[
  {
    "path": "posts/2021-09-27-hotroutesstreetprofiles/",
    "title": "HotRoutes and Street Profiles",
    "description": "Hot routes and street profiles.",
    "author": [
      {
        "name": "Reka Solymosi",
        "url": "https://www.research.manchester.ac.uk/portal/reka.solymosi.html"
      }
    ],
    "date": "2021-10-12",
    "categories": [],
    "contents": "\r\nIn this workshop, dr. Reka Solymosi will provide an introduction to various methods of analyzing and visualing spatial network data (such a street networks, or Underground lines).\r\nReka is a Lecturer in Quantitative Methods at the Department of Criminology at University of Manchester. Her research focuses on making use of new forms of data to gain insight into people’s behaviour and subjective experiences, particularly focusing on crime, victimisation, transport, and spatial research. She is also dedicated to promoting data literacy in social science study and practice.\r\nYou can find some of her work at her blog site\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-28T00:56:40+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-27-spatialregression/",
    "title": "Spatial Regression",
    "description": "Regression analysis and spatial regression analysis in R.",
    "author": [
      {
        "name": "Wouter Steenbeek",
        "url": "https://nscr.nl/en/medewerker/wouter-steenbeek/#onderzoeksgebieden"
      }
    ],
    "date": "2021-09-27",
    "categories": [],
    "contents": "\r\nThis workshop session was about using R for regression analysis, both in a non-spatial and a spatial context. Wouter and Stijn will be presenting parts of what they prepared for a recent book chapter (in press).These materials were scaned to get an idea of what the workshop will cover.Here you can find the data, the syntax and the html-file presented material\r\n\r\nWouter is a Senior Researcher at the NSCR. For analyses he has used Excel, SPSS, Stata Mplus, MLWiN, and QGis. Not a big fan of C++ and Java, but once upon a time he knew the basics. Wouter started using R around 2012, due to a collaboration with a visiting scholar who used R. Classic case of SIR model (Susceptible - Infection - Recovery) although he has never recovered from his R infection. Also, the R bug destroyed his interest in the above-mentioned programs :-). His main research interests are in spatial patterns of crime and quantitative research methods.\r\n\r\n\r\nStijn is a Senior Researcher and management team member at the NSCR. He is program leader of two of its five research groups, and also Professor at the Department of Sociology, Utrecht University. Stijn has used R ever since he attended the Summer School in Ann Arbor in 2004, even for generating his kitchen tiling pattern. His main research interests are in Geographic and Environmental Criminology, Policing, Quantitative, Analytical, and Computational Sociology, and he is a great believer in Open Science and Open-source.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-02T18:35:53+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-14-opendata/",
    "title": "OpenData",
    "description": "Introduction to open data and how they can be found, downloaded and processed in R.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/medewerker/sam-langton/"
      }
    ],
    "date": "2021-09-14",
    "categories": [],
    "contents": "\r\nThis workshop session provides an introduction to open data using R. Following a brief introductory presentation (e.g. definitions, purpose) the bulk of the workshop will focus on practical examples which demonstrate how to obtain and handle open data within the R environment.\r\nNo prior reading is necessary, but if you might want to skim through a recent book chapter (in press) by Sam and Reka Solymosi on using open data in R to study the geography of crime.\r\nHere you can find his materials: Sams presentation (presentation.pdf), his syntax (demo.R) and the results of his syntax (worksheet.pdf)\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on the spatial and temporal patterning of crime and police demand.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-28T01:00:10+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-spatioldata/",
    "title": "Spatial Data",
    "description": "How to work with spatial data.",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://nscr.nl/medewerker/dr-alex-trinidad/"
      }
    ],
    "date": "2021-09-02",
    "categories": [],
    "contents": "\r\nThe third meeting of the NSC-R Workshop was on Thursday September 2, 13:00-14:00 hr. Alex Trinidad introduced us to spatial data and how they can be processed in R.\r\nLearning to work with spatial data allows us to broaden our toolbox and our research horizons. In this workshop, we worked on the basic concepts of spatial data usage, data preparation, and basic visualisations. The aim was to introduce you to how to work with spatial data in R and provide materials that helped to go deeper into this type of data.\r\nTo prepare for the meeting, Alex suggested you might want to take a look at the following links. This is obviously not mandatory, but the materials may give rise to ideas or questions that you may want to discuss in the workshop meeting:\r\nLovelance, R., Nowosad, J., & Muenchow, J. Geocomputation with R. CRC Press.\r\nBivand, R. S., Pebesba, E., & Gómez-Rubio, V. Applied Spatial Data Analysis with R. Springer.(Access from university library)\r\nScripts and data you can find here.\r\n\r\nAlex is a postdoctoral researcher at the NSCR and the University of the Basque Country UPV/EHU. His interest in spatial analysis began when he started his PhD, exploring the spatial distribution of juvenile delinquency and the contextual factors associated with it. It was also during his PhD that he began his journey with R.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-28T01:02:59+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-rmarkdown/",
    "title": "RMarkdown",
    "description": "Introduction to literate programming using RMarkdown",
    "author": [
      {
        "name": "Asier Moneva",
        "url": "https://nscr.nl/en/medewerker/asier-moneva/"
      }
    ],
    "date": "2021-07-06",
    "categories": [],
    "contents": "\r\nMarkdown is a language for producing formatted text with a simple text editor conceived with the idea of being human-readable from source. If you remember Thomas de Graaff’s talk from two weeks ago, having human readable code is important for a number of reasons, such as being easy to debug, maintain, and extend.\r\nRMarkdown is simply a software that allows the implementation of this language in R. This makes it possible to produce open-access, fully reproducible documents.\r\nTo show you the basics, Asier followed the book R Markdown: The Definitive Guide by Xie, Allaire and Grolemund. He recommends you read the Preface before the workshop. However, as a definitive guide, you can deduce that this book does not only cover the basics, so you can also use it to go deeper.\r\nTo have all the main commands at hand, you can print this double-sided RMarkdown cheat sheet. (We love cheat sheets.)\r\nAnd for a quick overview of RMarkdown, just watch this video.\r\nHere you can find the presentation, scripts and additional materials.\r\nHere you can find an Elsevier template for RMarkdown\r\n\r\nAsier is a postdoc at the NSCR and The Hague University of Applied Sciences with a background in criminology. He started specializing in crime analysis with R during his master’s degree and has since developed an interest in open science.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-02T20:19:35+02:00",
    "input_file": "rmarkdown.knit.md"
  },
  {
    "path": "posts/2021-09-04-workshop1-reproducibility/",
    "title": "Reproducibility",
    "description": "How to organize your research workflow in R to create documented code and reproducible findings.",
    "author": [
      {
        "name": "Thomas de Graaff",
        "url": "https://research.vu.nl/en/persons/thomas-de-graaff"
      }
    ],
    "date": "2021-06-24",
    "categories": [],
    "contents": "\r\nOn Thursday June 24, 13:00-14:00, we kicked off the NSC-R Workshop initiative. The topic of this first meeting was reproducibility, which is about how to organize your research workflow to create documented code and reproducible findings. The focus was not on why (we should know), but on practical guidelines on how to do it. It was presented by Thomas de Graaff.\r\nHere you find the presentation\r\nTo prepare for the first meeting, Thomas de Graaff suggested you might want to take a look at the following links. This is obviously not mandatory, but the materials may give rise to ideas or questions that you may want to discuss in the workshop meeting:\r\n- A very readable post on reproducible workflow in R.\r\nA nice short blog post about R projects.\r\nIf you are using R already and in particular if you use tidyverse, a long book-down document from about [style] (https://style.tidyverse.org/index.html).\r\nA wonderful but distressing lecture (and long: about 50 minutes) from Richard McElreath about working with software in the social sciences, with a criminology paper example in the end on racial disparity in police use of deadly force.find here.\r\n\r\nThomas de Graaf is associate professor at the department of Spatial Economics at the Vrije Universiteit in Amsterdam.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-02T20:18:02+02:00",
    "input_file": "workshop1-reproducibility.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to NSC-R Workshops",
    "description": "Welcome to our new blog, NSCRWorkshops. We report from workshops which to place and alert you to workshops that are planned in the near future",
    "author": [
      {
        "name": "Wim Bernasco, Alex Trinidad, Asier Moneva and Sam Langton",
        "url": "https://nscr.nl"
      }
    ],
    "date": "2021-06-06",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nWe are a group which organize on regurly basis workshops on modern data analysis, mostly by using the R-program system. We want to share our knowledge and stimulate each in using new techniques xxx\r\n\r\n\r\n\r\n",
    "preview": "posts/welcome/workshop.png",
    "last_modified": "2021-09-27T11:48:41+02:00",
    "input_file": {},
    "preview_width": 480,
    "preview_height": 480
  }
]
