[
  {
    "path": "posts/2024-01-09-nsc-r-tidy-tuesday/",
    "title": "Tidy Tuesday Workshop",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://www.samlangton.info/"
      }
    ],
    "date": "2024-01-09",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which is aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThis workshop (January 9, 2024, 13:00-14:00) will be led by Sam Langton.\r\nPlease join us on January 9, 2024 at 13:00 CET on Zoom by clicking here using password NSCR.\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nMaterials will be posted here as soon as they are available.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-12-18T09:45:36+01:00",
    "input_file": "2024-01-09-nsc-r-tidy-tuesday.knit.md"
  },
  {
    "path": "posts/2023-12-12-nsc-r-workshop-ros/",
    "title": "Tidy Tuesday Reading Club",
    "description": "Participate in dynamic, interactive and engaging reading group sessions to explore the world of data analysis.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://www.samlangton.info/"
      }
    ],
    "date": "2023-12-12",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions draw their inspiration from the Tidy Tuesday initiative, a dedicated platform aimed at fostering a secure and supportive environment for individuals seeking to hone their data processing and visualization skills in R, all while working with real-world data.\r\nThis workshop will be the second one in the Reading Club format. For details about this format, please read the post of November 14. You can keep up to date with the material for each session via the corresponding GitHub repository.\r\nThis workshop will be chaired by Sam Langton. In this session, we will focus on Chapter 2 of Regression and Other Stories. Please have a read (however brief!) of the chapter before the session. Sam will choose a few sections and code examples to run through (using the tidyverse) and we can then discuss them as a group.\r\nJoin this session December 12, 2023 at 13:00 CET on Zoom by clicking here and using the passcode ‘NSCR’.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-12-18T08:51:36+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-11-28-nsc-r-tidy-tuesday/",
    "title": "Tidy Tuesday Workshop",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Danielle van Westbroek-Stibbe",
        "url": "https://nscr.nl/medewerker/danielle-stibbe-msc/"
      }
    ],
    "date": "2023-11-28",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which is aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThis workshop (November 28, 2023, 13:00-14:00) will be led by Danielle van Westbroek-Stibbe.\r\nPlease join us on November 28, 2023 at 13:00 CET on Zoom by clicking here\r\nWe will use the same data about Scooby-Doo episodes that we used in the workshop of October 31. This time, we will focus on visualization techniques using ggplot.\r\nThe data is provided and described by the Tidy Tuesday Initiative, and can be found here.\r\n\r\nDanielle van Westbroek-Stibbe is a PhD candidate at NSCR and Utrecht Universiteit and a member of the NSC-R Workshops team. Her research focuses on cybercriminal decision-making.\r\n\r\nMaterials\r\nDanielle will demonstrate and explain the contents of this R script.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-11-21T14:45:01+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-11-14-nsc-r-workshop-ros/",
    "title": "Tidy Tuesday Reading Club",
    "description": "Introduction of the Tidy Tuesday Reading Club sessions",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://www.alexandertrinidad.com/"
      }
    ],
    "date": "2023-11-14",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions draw their inspiration from the Tidy Tuesday initiative, a dedicated platform aimed at fostering a secure and supportive environment for individuals seeking to hone their data processing and visualization skills in R, all while working with real-world data.\r\nReading group format\r\nIn our previous “advanced” version of the workshop, we featured a team member or an external expert who led participants through more advanced methods. In this new season, we are transforming the advanced series of our workshops into a reading group format. Our aim is to offer a dynamic, interactive, and engaging way to explore the world of data analysis.\r\nJoin this session November 14, 2023 at 13:00 CET on Zoom by clicking here.\r\nRegression and other stories\r\nWe decided to work with the book Regression and other stories (ROS) by Andrew Gelman, Jennifer Hill and Aki Vehtari. This book was chosen because\r\nIt is freely available online, ensuring easy access for all participants.\r\nIt is packed with practical R examples that are also freely available online, enabling hands-on learning.\r\nIt covers a wealth of content on data analysis techniques used in criminological research.\r\nFormat\r\nThe format shifts from previous workshops to an interactive reading club approach. To keep participation maximally accessible to many, the sessions will continue to be online (on Zoom). To make them most instructive for everyone, we advice participants to read the designated chapter from Regression and other stories in advance and, when possible, practice with some of the examples. During the session, one of our team members will chair the discussion, where the participants will share their experiences and issues with the examples. The focus is on participation and collaborative learning, creating a relaxed atmosphere conducive to in-depth understanding. You can keep up to date with the material for each session via the corresponding GitHub repository.\r\nFor our first session, November 14, 2023 at 13:00 CET, we will introduce the new format and delve into Chapter 1 of Regression and Other Stories. Be prepared to discuss the chapter’s content, ask questions, and witness live coding in action. To join the session on Zoom, please click here (Meeting ID: 839 9021 1542 ; password 368781)\r\nKey Objectives\r\nParticipative learning: We believe that active participation enhances learning. This workshop is designed to encourage your active involvement.\r\nHands-on practice: You’ll get the chance to practice R coding in real-time, bolstering your practical skills.\r\nExploration of R techniques: Together, we’ll explore and understand various data analysis techniques.\r\nWho should attend?\r\nThis workshop is perfect for you if\r\nYou’re looking to enhance your R programming and data analysis skills.\r\nYou prefer a participative learning environment that emphasizes active engagement.\r\nYou’re interested in gaining practical experience with data analysis techniques in R.\r\nMaterials\r\nThe book Regression and other stories\r\nExamples from the book\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-12-18T08:51:36+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-10-31-nsc-r-workshop-scooby-doo/",
    "title": "Tidy Tuesday with Scoobie-Doo",
    "description": "What monsters were caught on Scooby-Doo? Who caught the most of them? How many of them remained uncaught?",
    "author": [
      {
        "name": "Danielle van Westbroek-Stibbe",
        "url": "https://nscr.nl/medewerker/danielle-stibbe-msc/"
      }
    ],
    "date": "2023-10-31",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which is aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThis workshop (October 31, 2023, 13:00-14:00) was led by Danielle van Westbroek-Stibbe.\r\nUsing data from ScoobyPedia, we practiced data wrangling and visualization techniques taught in our recent Carpentry course “R for Social Scientists” to answer those questions and more.\r\nThe data we used is provided and described by the Tidy Tuesday Initiative, and can be found here.\r\n\r\nDanielle van Westbroek-Stibbe is a PhD candidate at NSCR and Utrecht Universiteit and a member of the NSC-R Workshops team. Her research focuses on cybercriminal decision-making.\r\n\r\nMaterials\r\nTo get started, you can use this R script, which loads required libraries and the scooby-doo data and also contains some exercises.\r\nTo learn how the exercises discussed in the workshop can be completed, see this document\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-11-21T14:03:10+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-06-021-summer-break/",
    "title": "Summer break 2023",
    "description": "The NSC-R Team wishes you a great summer",
    "author": [
      {
        "name": "NSC-R Team",
        "url": {}
      }
    ],
    "date": "2023-06-21",
    "categories": [],
    "contents": "\r\nDuring July, August and September 2023, no NSC-R workshops are being organized. We hope to see you back after the break.\r\nHave a great summer!\r\nThe NSC-R Workshops team\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-06-21T14:38:09+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-06-06-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://www.alexandertrinidad.com/"
      }
    ],
    "date": "2023-06-06",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which is aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nIn this workshop (June 6, 2023, 13:00-14:00), Alex Trinidad will discuss how to do regression diagnostrics in R.\r\nJoin this hybrid workshop in the NSCR Colloquium Room or online on Zoom here\r\n\r\nAlex Trinidad is a postdoctoral researcher and lecturer at the Institute of Sociology and Social Psychology (ISS) at the University of Cologne, and a research fellow for the Crime Events in Context research group at the NSCR and for the Crim-Ap research group at the University of the Basque Country UPV/EHU. He is also a member of the NSC-R Workshops Team.\r\n\r\nMaterials\r\nHere you will find the R syntax to replicate the session.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-06-21T14:32:33+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-06-02-walk-in-hour/",
    "title": "NSC-R Walk-In Hour",
    "description": "Drop by and meet our team to discuss any R-related issues",
    "author": [
      {
        "name": "NSC-R Workshops Team",
        "url": {}
      }
    ],
    "date": "2023-06-02",
    "categories": [],
    "contents": "\r\nFriday June 2, 13:00-14:00 (NSCR Colloquium room and on Zoom)\r\nThe NSC-R Walk-In Hour is a recurring event where you can drop by and meet our team to discuss any R-related issues. Whether you have urgent questions, want to work on your R project, or simply want to socialize with fellow R enthusiasts, you are welcome to join!\r\nThe Walk-In Hour takes place bi-weekly, normally on Fridays between 13:00 and 14:00. It has a hybrid format, with an in-person meeting in the Colloquium room at the NSCR and an open online Zoom session running in parallel.\r\nThere is no need to register. Simply bring your laptop and join us in person or online.\r\nIf you have a private R-related query, you can contact us via e-mail, Zoom private chat, or phone. There will be an NSC-R member present both online and offline to assist.\r\nJoin this event on Zoom by clicking this link\r\n\r\nThe NSC-R Workshops Team organizes workshops, courses and other events related to R. The members are Wim Bernasco, Sam Langton, Asier Moneva, Abby Onencan, Alex Trinidad, and Danielle van Westbroek-Stibbe.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-05-12T12:20:55+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-05-23-webscraping/",
    "title": "Web scraping",
    "description": "Use R to extract data from internet.",
    "author": [
      {
        "name": "Danielle van Westbroek-Stibbe",
        "url": "https://nscr.nl/medewerker/danielle-stibbe-msc/"
      }
    ],
    "date": "2023-05-23",
    "categories": [],
    "contents": "\r\nThis was a hybrid workshop (May 23,2023, 13:00-14:00), physically in the Breakout Room at NSCR and online on Zoom.\r\nIn this NSC-R workshop Danielle van Westbroek-Stibbe described and demonstrated web scraping in R. Web scraping involves the extraction of data from websites, which can be done manually (e.g., copy-pasting) or automatically. This process extends beyond existing datasets, allowing you to retrieve any type of data found on a webpage. Once the information is saved to disk in HTML format, we can parse it to become more readable.\r\nIn this workshop, Danielle demonstrated how we can use the R package “rvest” to extract data from the NSC-R Workshops website. During this demonstration, she created a comprehensive dataset that encompasses the workshops conducted with the NSC-R community.\r\nContent of the workshop:\r\nWhat is web scraping and what is it used for?\r\nHTML basics\r\nWeb scraping and parsing in R\r\nRequired packages:\r\nFor web scraping and parsing: rvest\r\nFor tidy coding: dplyr\r\nTo read a little about web scraping, please refer to this source.\r\n\r\nDanielle van Westbroek-Stibbe is a PhD candidate at NSCR and Utrecht Universiteit and a member of the NSC-R Workshops team. Her research focuses on cybercriminal decision-making.\r\n\r\nMaterials\r\nAll elements that Danielle presented and discussed during the workshop are included in this Markdown document which you can open (and adapt if you wish) and knit in the Rstudio environment).\r\nAlternatively, you can also immediately view the result as a HTML document here\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-05-24T12:42:26+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-05-09-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Wim Bernasco",
        "url": "https://nscr.nl/en/medewerker/prof-dr-wim-bernasco/"
      }
    ],
    "date": "2023-05-09",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which is aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nIn this workshop (May 9, 2023, 13:00-14:00), Wim Bernasco tried to model song popularity using a dataset of tracks on Spotify.\r\nEven if you have no interest in popular music at all, you may find the materials presented in the workshop instructive for getting ideas on how to do regression analysis in R.\r\nThe workshop did not delve into statistics, but rather show how to get linear regression and logistic regression models running in R and generate useful and reproducible output. The focus was be on ordinary least squares and (quite briefly) logistic regression, but the techniques can easily be generalized to other regression models.\r\n\r\nWim Bernasco is a senior researcher at NSCR and a member of the NSC-R Workshops team. His research focuses on the geography of crime.\r\n\r\nMaterials\r\nMaterials for this workshop have been posted here on GitHub. The Quarto document regression_spotify.qmd contains the annotated R script. You can use the short script get_started.R to read the data and conduct your own analysis.\r\nSome substabtive documentation on the data is available here\r\nDownloading files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-05-15T13:03:33+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-05-04-walk-in-hour/",
    "title": "NSC-R Walk-In Hour",
    "description": "Drop by and meet our team to discuss any R-related issues",
    "author": [
      {
        "name": "NSC-R Workshops Team",
        "url": {}
      }
    ],
    "date": "2023-05-04",
    "categories": [],
    "contents": "\r\nThursday May 4, 13:00-14:00 (NSCR Colloquium room and on Zoom)\r\nThe NSC-R Walk-In Hour is a recurring event where you can drop by and meet our team to discuss any R-related issues. Whether you have urgent questions, want to work on your R project, or simply want to socialize with fellow R enthusiasts, you are welcome to join!\r\nThe Walk-In Hour takes place bi-weekly, normally on Fridays between 13:00 and 14:00. It has a hybrid format, with an in-person meeting in the Colloquium room at the NSCR and an open online Zoom session running in parallel.\r\nThere is no need to register. Simply bring your laptop and join us in person or online.\r\nIf you have a private R-related query, you can contact us via e-mail, Zoom private chat, or phone. There will be an NSC-R member present both online and offline to assist.\r\nJoin this event on Zoom by clicking this link\r\n\r\nThe NSC-R Workshops Team organizes workshops, courses and other events related to R. The members are Wim Bernasco, Sam Langton, Asier Moneva, Abby Onencan, Alex Trinidad, Danielle van Westbroek-Stibbe and Franziska Yasrebi-de Kom.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-04-06T22:29:38+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-04-25-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Asier Moneva",
        "url": "https://asiermoneva.com/"
      }
    ],
    "date": "2023-04-25",
    "categories": [],
    "contents": "\r\nThis one-hour workshop starts at 13:30.\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThe dataset for this hybrid workshop is the Premier League Match Data 2021-2022 (via Evan Gower on Kaggle). Have you ever heard that some referees tend to give home advantage? Asier will look at which Premier League referees had the highest ratio of home and away wins in the 2021/22 season. Feel free to explore this question yourselves and share your experience with us.\r\nJoin the workshop either in-person at the NSCR Colloquium Room or on Zoom by clicking this link\r\n\r\nAsier Moneva is a postdoc at the Netherlands Institute for the Study of Crime and Law Enforcement (NSCR) and at the Center of Expertise Cyber Security at The Hague University of Applied Sciences. He is also a member of the NSC-R Workshops Team. For more details check out his website.\r\n\r\nMaterials\r\nMaterials for this workshop will be posted here when they become available.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-04-18T10:27:40+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-04-21-walk-in-hour/",
    "title": "NSC-R Walk-In Hour",
    "description": "Drop by and meet our team to discuss any R-related issues",
    "author": [
      {
        "name": "NSC-R Workshops Team",
        "url": {}
      }
    ],
    "date": "2023-04-21",
    "categories": [],
    "contents": "\r\nFriday April 21, 13:00-14:00 (NSCR Colloquium room and on Zoom)\r\nThe NSC-R Walk-In Hour is a recurring event where you can drop by and meet our team to discuss any R-related issues. Whether you have urgent questions, want to work on your R project, or simply want to socialize with fellow R enthusiasts, you are welcome to join!\r\nThe Walk-In Hour takes place bi-weekly, normally on Fridays between 13:00 and 14:00. It has a hybrid format, with an in-person meeting in the Colloquium room at the NSCR and an open online Zoom session running in parallel.\r\nThere is no need to register. Simply bring your laptop and join us in person or online.\r\nIf you have a private R-related query, you can contact us via e-mail, Zoom private chat, or phone. There will be an NSC-R member present both online and offline to assist.\r\nJoin this event on Zoom by clicking this link\r\n\r\nThe NSC-R Workshops Team organizes workshops, courses and other events related to R. The members are Wim Bernasco, Sam Langton, Asier Moneva, Abby Onencan, Alex Trinidad, Danielle van Westbroek-Stibbe and Franziska Yasrebi-de Kom.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-04-06T22:29:00+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-04-11-quarto/",
    "title": "Quarto",
    "description": "Using R Studio with Quarto to write blogs and research papers",
    "author": [
      {
        "name": "Harrie Jonkman",
        "url": {}
      }
    ],
    "date": "2023-04-11",
    "categories": [],
    "contents": "\r\nWe will soon host our first hybrid NSC-R workshop. You are very welcome to join us in the Colloquium Room at NSCR, which for the occasion will be labeled the NSC-R Studio. The workshop will of course also be hosted on Zoom as usual.\r\nIn this NSC-R workshop Harrie Jonkman will show us how to work with Quarto. Quarto is a tool that helps you write research papers and blogs. It is a modern version of RMarkdown that is part of RStudio. Quarto can be used to write (reproducible) research papers and blogs that integrate text with data analysis and visualization.\r\nAfter the workshop we should know how Quarto works and understand the basic principles of making a blog, and can transfer this knowledge to writing a paper or report (or making a website, or book).\r\nTo profit most from this workshop, you need to have a very basic knowledge of R and R Markdown.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nHarrie Jonkman recently retired. He was senior researcher at the Verwey-Jonker Institute. He worked in the field of education and prevention and the social and cognitive development of children and youngsters. You can find more information on his personal website. He has his own blog Harrie’s Hoekje on modern data-analysis.\r\n\r\nMaterials\r\nThe materials that Harrie used in his workshop are not only about Quarto, they were also produced using Quatro. Links to the Quarto-presentation and a Quarto-blog you find beneath. When you want to see how he made the presentation, the blog and the articles you find all the materials in three repositories on his GitHub space. So:\r\nThe introductory presentation you can find here. All the material for this presentation in Quarto you can find here\r\nThe Quarto-style blogversion of the NSC-R Workshops website is here. When you want to see how this blog is made you can find in this repository here\r\nAnd examples of standalone articles created with Quarto are here\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd or qmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-04-18T10:20:21+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-03-14-getting-help/",
    "title": "Learning to learn R",
    "description": "Solving errors and getting help when using R",
    "author": [
      {
        "name": "NSC-R Workshops Team and others",
        "url": "https://nscrweb.netlify.app/"
      }
    ],
    "date": "2023-03-14",
    "categories": [],
    "contents": "\r\nLearning is making mistakes and finding ways to solve them. This meeting will be about how to learn from mistakes when working with R. We will discuss how to recognize, understand and solve errors, and how to learn from online sources and the skills of other people in the R community.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nThe meeting will have a seminar-like format with short presentations by Matt Ashby, Danielle van Westbroek-Stibbe, Asier Moneva and Tim Verlaan.\r\n\r\nMaterials\r\nTo prepare for the meeting, you want to take a look at these materials, which are being developed by Matt Ashby.\r\nTo run the tutorial, run these lines from the R Studio editor:\r\n# Install the 'remotes' packages\r\ninstall.packages(\"remotes\")\r\n# Using this package, install the crimemapping package from GitHub\r\nremotes::install_github(\"mpjashby/crimemapping\")\r\n# Run the tutorial\r\ncrimemapping::tutorial(\"07_handling_bugs\")\r\nDanielle used this example script to illustrate her presentation about debugging.\r\nAsier used this example script to illustrate his presentation about minimal reproducible examples or reprexes.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-02-21-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://www.alexandertrinidad.com/"
      }
    ],
    "date": "2023-02-21",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nIn this workshop, Alex Trinidad will show how to write your own R functions. This helps automating your work and making your R scripts cleaner, shorter and easier to maintain.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nAlex Trinidad is a postdoctoral researcher and lecturer at the Institute of Sociology and Social Psychology (ISS) at the University of Cologne, and a research fellow for the Crime Events in Context research group at the NSCR and for the Crim-Ap research group at the University of the Basque Country UPV/EHU. He is also a member of the NSC-R Workshops Team.\r\n\r\nMaterials\r\nHere you will find the R syntax to replicate the session.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-05-12T23:15:35+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-01-24-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Franziska Yasrebi-de Kom",
        "url": "https://nscr.nl/en/medewerker/franziska-yasrebi-msc/"
      }
    ],
    "date": "2023-01-24",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which\r\nwas aimed at providing a safe and supportive forum for individuals to\r\npractice their data processing and visualization skills in R while\r\nworking with real-world data.\r\nJoin this workshop meeting on Zoom by clicking this\r\nlink\r\n\r\nFranziska Yasrebi-de Kom is a PhD student at the\r\nNSCR.\r\n\r\nMaterials\r\nA do-it-yourself start-up\r\nscript with questions to optionally prepare for the workshop.\r\nA full\r\nscript containing solutions to the exercises listed in the\r\ndo-it-yourself script.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-06-simulation/",
    "title": "Simulation",
    "description": "Learn how to use simulation in R.",
    "author": [
      {
        "name": "Lisa DeBruine",
        "url": "https://debruine.github.io/"
      }
    ],
    "date": "2022-12-06",
    "categories": [],
    "contents": "\r\nIn this workshop, Lisa DeBruine will show how you\r\ncan use R to conduct simulations.\r\nThis session will cover the basics of simulation using the R package\r\nfaux. We will simulate data with factorial designs by\r\nspecifying the within and between-subjects factor structure, each cell\r\nmean and standard deviation, and correlations between cells where\r\nappropriate. This can be used to create simulated data sets to be used\r\nin preparing the analysis code for pre-registrations or registered\r\nreports. We will also create data sets for simulation-based power\r\nanalyses. Participants will need to have very basic knowledge of R and R\r\nMarkdown, and have installed faux, afex,\r\nbroom and tidyverse.\r\nJoin this workshop meeting on Zoom by clicking this\r\nlink\r\n\r\nLisa DeBruine is a professor of psychology at the\r\nUniversity of Glasgow School of Psychology and Neuroscience. She is a\r\nfounding member and current Associate Director of the Psychological\r\nScience Accelerator, a member of the APA Open Science and Methodology\r\nCommittee, a local lead for the UK Reproducibility Network, a member of\r\nthe ORCiD Researcher Advisory Council, and a member of the psyTeachR\r\nteam for reproducible research educational resources.You can read more\r\nabout Lisa and her work on her\r\npersonal website.\r\n\r\nMaterials\r\nThe materials used in the workshop are on Lisa’s\r\nGithub.\r\nThe RMarkdown (Rmd) file she will be working with is linked from\r\nthere at https://raw.githubusercontent.com/debruine/data-sim-workshops/master/inst/stubs/faux-stub.Rmd)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-11-29-search-term-selection-systematic-reviews/",
    "title": "Automated search term selection for systematic reviews",
    "description": "Improve systematic reviews by automating search term selection using R package litsearchR.",
    "author": [
      {
        "name": "Eliza Grames",
        "url": "https://elizagrames.github.io/"
      }
    ],
    "date": "2022-11-29",
    "categories": [],
    "contents": "\r\nIn this workshop, Eliza Grames will explain how the\r\nR package litsearchR can be used for quick, objective,\r\nreproducible development of search strategies in systematic reviews. The\r\npackage uses text-mining and keyword co-occurrence networks to identify\r\nimportant terms to include in a search strategy.\r\nPlease note that this workshop starts at 16:00.\r\nJoin this workshop meeting on Zoom by clicking this\r\nlink\r\n\r\nEliza Grames is a post-doctoral scholar at the\r\nUniversity of Nevada Reno. Amongst other topics, she works on methods to\r\nconduct meta-analyses on disparate and diverse time series datasets.\r\nEliza completed her PhD in Ecology and Evolutionary Biology in 2021 at\r\nthe University of Connecticut, where she worked on developing new\r\nmethods of evidence synthesis. Broadly speaking, she is interested in\r\nany involving cool research methods, birds, insects, conservation,\r\nquantitative ecology, and evidence synthesis. You can read more about\r\nEliza and her work on her\r\npersonal website.\r\n\r\nMaterials\r\nIn this compressed folder (ZIP\r\nfile) are the script and data that contain a full example of using\r\nlitsearchr from start to finish, with an example on\r\nde-escalation training effectiveness. Eliza will run through the full\r\nthing including the steps outside of R (e.g. exporting the search\r\nresults).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-11-15-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Wim Bernasco",
        "url": "https://nscr.nl/en/medewerker/prof-dr-wim-bernasco/"
      }
    ],
    "date": "2022-11-15",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which\r\nwas aimed at providing a safe and supportive forum for individuals to\r\npractice their data processing and visualization skills in R while\r\nworking with real-world data.\r\nIn this workshop, Wim will explore a Tidy Tuesday dataset about the\r\nErasmus student mobility program. This dataset was used in the main Tidy\r\nTuesday of week 10 in 2022. For more information on this data, including\r\nthe codebook, see the\r\nRForDataScience GitHub registry.\r\nIn today’s workshop, the focus will be on exploring, analyzing, and\r\nmaybe visualizing student streams between countries. Example questions\r\nto be answered include:\r\nHow many students studied abroad?\r\nWhat are the top-10 receiving countries?\r\nWhat are the top-10 sending countries?\r\nWhich are the 10 most frequent origin-destination country\r\ncombinations\r\nAre reverse flows (the flow from A to B and the flow from B to A)\r\ncorrelated?\r\nHow does total number of students from country A to country B depend\r\non the total number of student from A and the total number of students\r\nfrom B?\r\nDo adjacent countries attract more or less students than\r\nnon-adjacent countries?\r\nJoin this workshop meeting on Zoom by clicking this\r\nlink\r\n\r\nWim Bernasco is a senior researcher at the\r\nNetherlands Institute for the Study of Crime and Law Enforcement (NSCR)\r\nand a professor in Spatial analysis of crime at the School of\r\nBusiness and Economics at the Vrije Universiteit Amsterdam. Most of his\r\nwork in criminology is about the geography of crime, offender decision\r\nmaking and situational causes of crime.\r\n\r\nMaterials\r\nThis\r\nGitHub repository contains a startup script\r\n(script_student_mobility.R)and two helper data files\r\n(country_names.csv and adjacency.csv).\r\nWim will use the packages here, tidyverse\r\nand tidytuesdayR in the workshop.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-11-01-conjunctive-analysis/",
    "title": "Conjunctive analysis of case configurations",
    "description": "What is conjunctive analysis and how to do it in R",
    "author": [
      {
        "name": "Asier Moneva",
        "url": "https://nscr.nl/en/medewerker/asier-moneva/"
      }
    ],
    "date": "2022-11-01",
    "categories": [],
    "contents": "\r\nIn this workshop Asier Moneva will explain what\r\nConjunctive Analysis of Case Configurations (CACC) is about, and how it\r\ncan be conducted in R with the help of the cacc package.\r\nAsier will first introduce the CACC and then perform a live\r\ndemonstration of the cacc package from RStudio.\r\nJoin this workshop meeting on Zoom by clicking this\r\nlink\r\n\r\nAsier Moneva is a postdoc at the NSCR and The Hague\r\nUniversity of Applied Sciences with a background in criminology. He\r\nstarted specializing in crime analysis with R during his master’s degree\r\nand has since developed an interest in open science.\r\n\r\nMaterials\r\nA link to the\r\ndevelopment version of the cacc R package in GitHub. The\r\nREADME.md file contains a description of the package and\r\nwalks readers through some examples.\r\n[Placeholder for the slides from Asier’s workshop presentation]\r\nAsier will use the following R packages in the workshop:\r\ndevtools\r\ntidyverse\r\nTo install them, you can run the code below:\r\n\r\n\r\nif (! require(\"devtools\")) install.packages(\r\n  pkgs = \"devtools\",\r\n  repos = \"http://cran.us.r-project.org\"\r\n)\r\n\r\nif (! require(\"tidyverse\")) install.packages(\r\n  pkgs = \"tidyverse\",\r\n  repos = \"http://cran.us.r-project.org\"\r\n)\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-10-05-installing-rstudio-and-r/",
    "title": "Installing R Studio and R software",
    "description": "If you are a participant of the two-day workshop on Using R for Reproducible Social Science, these notes may be useful to help you install R Studio and R on your computer. If you work from a NSCR laptop, you can skip this guide because you can use the remote desktop server.",
    "author": [
      {
        "name": "NSC-R Team",
        "url": "URL"
      }
    ],
    "date": "2022-10-05",
    "categories": [],
    "contents": "\r\nTo participate in the workshop Using R for Reproducible\r\nSocial Science, you need to have access to a working R\r\ninstallation. This can be an installation on a remote computer (for NSCR\r\nparticipants) or a local installation on your laptop (for all\r\nothers).\r\nIf you need to create a local installation on your laptop (i.e. if\r\nyou are not an NSCR participant), please visit the Data Carpentries\r\nwebsite for installations instructions (both Windows and MacOS). You\r\ncan ignore the text under the header “For everyone”.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-10-05-using-r-for-reproducible-social-science/",
    "title": "2-day workshop on Using R for Reproducible Science",
    "description": "These are support materials for the 2-day workshop *Using R for Reproducible Science*.",
    "author": [
      {
        "name": "NSC-R Team",
        "url": {}
      }
    ],
    "date": "2022-10-05",
    "categories": [],
    "contents": "\r\nOn this place you will soon be able to find the materials for the\r\nworkshop, such as slides, and example code.\r\nThe materials for day 1\r\nof the workshop.\r\nThe materials for\r\nday 2 (morning).\r\nThe materials for\r\nday 2 (afternoon).\r\nA short script that\r\ndemonstrates joining with non-unique keys\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-08-summer-break/",
    "title": "Summer break 2022",
    "description": "The NSC-R Team wishes you a great summer",
    "author": [
      {
        "name": "NSC-R Team",
        "url": {}
      }
    ],
    "date": "2022-07-08",
    "categories": [],
    "contents": "\r\nDuring July and August, no NSC-R workshops are being organized. We\r\nhope to be back in September with a new series. Please let us know if\r\nyou have any ideas for the organization of the workshops, or if you have\r\nsuggestions for topics or for instructors (including yourself).\r\nHave a great summer!\r\nThe NSC-R Workshops team\r\nWim Bernasco (wbernasco@nscr.nl), Sam Langton (slangton@nscr.nl),\r\nAsier Moneva (amoneva@nscr.nl) Alex Trinidad (atrinidad@nscr.nl) and\r\nFranziska Yasrebi-de Kom (FYasrebi@nscr.nl).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-06-09-writing-r-packages/",
    "title": "Writing R packages",
    "description": "How to write R packages that make life easier for you yourself and for others",
    "author": [
      {
        "name": "Sophie Curtis-Ham",
        "url": "https://www.researchgate.net/profile/Sophie-Curtis-Ham"
      }
    ],
    "date": "2022-06-09",
    "categories": [],
    "contents": "\r\nR packages are collections of functions and datasets that extend the base functionality of R. You are already familar with them because whenever you type, for example, library(dplyr) in your R script you are using a package `dplyr’ and its functions. In this workshop Sophie Curtis-Ham will demonstrate how you yourself can create R packages.\r\nNote that the workshop is in the morning: 10:00-11:00. Join this workshop meeting on Zoom by clicking this link\r\n\r\nSophie Curtis-Ham, PhD, is Senior Research and Insights Advisor at the New Zealand police. She is the author of the R package gpsmartr, a tool for supporting geographic offender profiling.\r\n\r\nMaterials\r\nThe slides that Sophie uses in the workshop.\r\nSophie uses a couple of R packages in the workshop:\r\nTo reproduce the examples, you need to have installed a couple of packages (devtools, usethis, tidyverse, rlang, broom, here). To install them all, run: install.packages(c(\"devtools\",\"usethis\", \"tidyverse\", \"rlang\", \"broom\", \"here\"))\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-31-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/en/medewerker/sam-langton/"
      }
    ],
    "date": "2022-05-31",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nJoin this workshop meeting on Zoom by clicking this link\r\nYou are welcome to join the meeting and have a good time without any preparation, but you will probably get most from the meeting if some time before the workshop you spend an hour on preparation, by trying to perform some of the steps below.\r\nPreparation for the workshop\r\nCreate a new folder on your computer. You can name it whatever you want, but it is good practice to not include spaces. So, perhaps call it something like “tidytuesday_may2022”.\r\nOpen up RStudio. In the top left, you will see blue cube icon which when you hover over it will say Create a project. Click on this icon, choose existing directory, Browse, and then find and select the folder you have just created (e.g., tidytuesday_may2022). Once the folder has been selected, click Create Project.\r\nYou are now working in an R Project, hooray! One major benefit of working within an R Project is that all your working directories will now begin wherever the project is located (i.e., the tidytuesday_may2022 folder). Try this now by running getwd() in the R Console. If you save all your data, scripts and project materials here, or in subfolders, you will find it way easier to manage your work, and your code will look cleaner too, courtesy of the shorter working directories.\r\nLet’s start by creating some relevant folders in our project folder. You can do this manually, but let’s try it in RStudio. In the R Console, just type and run dir.create(\"scripts\"). This should have created a new folder called scripts in your project folder. You can save all your scripts here. Try it again for our data folder: dir.create(\"data\"). These subfolders should now existing within your project folder.\r\nFor the workshop, we are going to use some open data on 911 calls in Detroit, United States. I have written a very short script which loads the data automatically. You just need to download this script, save it in the scripts folder, and run it. You can find the script here. Either copy and paste the code into an R script, or right click on Raw (right hand side) and click Save link as…. Remember to save the script in your scripts folder.\r\nOpen up the script and run it. It should download the data automatically and then end with a brief summary of the data thanks to glimpse().\r\nTry to figure out the following. No pressure – you can ask us about anything queries or problems you have during the workshop!\r\nWhat variable names are in the data?\r\nHow many 911 calls for service (i.e., rows) do we have?\r\nWhat is the average response time (totalresponsetime) for calls?\r\nWhat is the most common call type? The call type is defined by the calldescription variable.\r\nHow many calls were in-progress shots fired (‘SHOTS FIRED IP’)?\r\nHow does average response time differ between call types? Here, you might want to use group_by().\r\nExplore some temporal trends. What hours of the day have the highest frequency of shots fired? Here, you will want to make use of functions in the lubridate package.\r\nSee you on Tuesday!\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nAll you need is the script mentioned above, which can be viewed here. Either copy and paste the code into an R script, or right click on Raw (right hand side) and click Save link as…. Remember to save the script in your scripts folder (see above).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-24-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Wim Bernasco",
        "url": "https://nscr.nl/en/medewerker/prof-dr-wim-bernasco/"
      }
    ],
    "date": "2022-05-24",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nJoin this workshop meeting on Zoom by clicking this link\r\nYou are welcome to join the meeting and have a good time without any preparation, but you will probably get most from the meeting if some time before the workshop you spend an hour on preparation, by trying to perform some of the steps below.\r\nPreparation for the workshop\r\nBelow, in the Materials section, are links to two small datasets. One (crime.csv) contains the number of police recorded residential burglaries, bike thefts and assaults in the Netherlands per month between January 2012 and April 2022. The other (population.csv) contains the number of inhabitants of the Netherlands during the same period, per first day of the month (below, in the Materials section, you can find a link to the R script that creates these files by downloading open data from Statistics Netherlands).\r\nIn the workshop we will together try to make sense of long-term temporal trends in these crimes, and hopefully also make useful statements about how things changed when the COVID pandemic arrived around February 2020.\r\nWe would suggest you just spend a single hour on preparation, no matter how far you get. Use any help you can find. Even very experienced R users consult the help files, their colleagues and the internet all the time, and so should you. Make sure you keep your R code in a script that you could share in the workshop, so we can learn from your ideas and creativity, and from your issues and errors.\r\nCreate a new folder on the computer where you run R, and store the two datafiles crime.csv and residents.csv in the folder.\r\nRead both files from disk and assign each a name. Any name will do, but I suggest “crime” and “ residents”.\r\nExplore the structure of the files. How many rows (observations), how many columns (variables), what are the variable names? What are their types: Are they integers, characters, dates, factors, …? keys?\r\nVisualize (plot) the development of the population size of the Netherlands between January 2012 and April 2022, and do the same for the frequencies of residential burglary, bike theft and assault.\r\nCreate a residential burglary rate by relating number of residential burglaries to the size of the population, and think about how you can adjust for different months having a differentnumbers of days (28-31). To do this, you will need to merge (join) the “crime” dataframe with the “residents” dataframe by year and month.\r\nVisualize the development of the three crime rates.\r\nWhat can we say about the development of crime since February 2020, relative to the developments between 2012 and 2020? How can you quantify this with the data at hand?\r\nDo anything else with the data that you find fun or seems to make sense\r\n\r\nWim Bernasco is senior researcher at NSCR and professor at the School of Business and Economics at the Vrije Universiteit Amsterdam. His work focuses on the geography of crime, incuding crime location choice and offender mobility. Read more on his personal website.\r\n\r\nMaterials & Instructions\r\nThe datasets crimes.csv and population.csv, the R script that created these datasets, and the R script that analyses them is in this GitHub repository.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-17-hotroutesstreetprofiles/",
    "title": "Hot Routes and Street Profiles",
    "description": "Hot routes and street profiles.",
    "author": [
      {
        "name": "Reka Solymosi",
        "url": "https://www.research.manchester.ac.uk/portal/reka.solymosi.html"
      }
    ],
    "date": "2022-05-17",
    "categories": [],
    "contents": "\r\nIn this workshop, Reka Solymosi will introduce and discuss the implementation in R of two different methods for visualising crime along a route or network (such as rail or street networks): hot routes and street profile analysis.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nReka Solymosi is a Lecturer in Quantitative Methods at the Department of Criminology at University of Manchester. Her research focuses on making use of new forms of data to gain insight into people’s behaviour and subjective experiences, particularly focusing on crime, victimisation, transport, and spatial research. She is also dedicated to promoting data literacy in social science study and practice.\r\n\r\nMaterials\r\nA tutorial on hot routes is here.\r\nA tutorials on street profile analysis is here\r\nThe slides from Reka’s workshop presentation are here\r\nThe data used in Reka’s workshop presentation are here\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-12-cbsdata/",
    "title": "cbsodataR package",
    "description": "Demonstrating the cbsodataR package in R",
    "author": [
      {
        "name": "Edwin de Jonge",
        "url": {}
      }
    ],
    "date": "2022-05-12",
    "categories": [],
    "contents": "\r\nIn this workshop, Edwin De Jonge from Statistics Netherlands (CBS) provided an introduction and demonstration to his package cbsodataR which can be used to query the CBS open data API.\r\nMaterials\r\nYou can find a quick start guide to using the package here.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-03-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://www.alexandertrinidad.com/"
      }
    ],
    "date": "2022-05-03",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThe dataset for this Tidy Tuesday is about Collegiate Sports in US. Alex Trinidad explores how revenue and expenditure are distributed in sports. He also looks at the differences in sport revenues and expenditures between men and women.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nAlex Trinidad is a postdoctoral researcher/ lecturer at the Institute of Sociology and Social Psychology (ISS) at the University of Cologne, Germany. He is also a research fellow at the Netherlands Institute for the Study of Crime and Law Enforcement (NSCR). His interest in spatial analysis began when he started his PhD, exploring the spatial distribution of juvenile delinquency and the contextual factors associated with it. It was also during his PhD that he began his journey with R.\r\n\r\nMaterials & Instructions\r\nThe R script that Alex worked with is in this GitHub repository that Alex worked with. Please feel free to copy and paste the syntax in an new R script. If you run the whole script be aware that some errors will come up. Those are made on purpose, and the solution is in the next lines. If the error is due to a lack of package, check some of the comments (#) in the script, and install the needed package.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-28-multiple-imputation-in-r/",
    "title": "Multiple Imputation of Missing Values in R",
    "description": "How to use R package 'mice' to solve missing data problems by multiple imputation",
    "author": [
      {
        "name": "Stef van Buuren",
        "url": "https://stefvanbuuren.name"
      }
    ],
    "date": "2022-04-28",
    "categories": [],
    "contents": "\r\nIn this workshop we laerned why and how you can use the R package mice to solve missing data problems by means of multiple imputation. Multiple imputation is a generic approach to analyse incomplete data that reduces bias and increases precision.\r\nTo get an idea of what the workshop was about, you could read (in Dutch) this short and accessible overview of multiple imputation. Alternatively, you could check out the (English) Wikipedia page.\r\nTo install the R package mice , copy and paste the next line into your R Studio Editor and run it:\r\ninstall.packages(“mice”)\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nStef van Buuren is Professor of Statistical Analysis of Incomplete Data at the University of Utrecht and Principal Scientist at the Netherlands Organisation for Applied Scientific Research TNO in Leiden. He invented the MICE algorithm for multiple imputation of missing data. Here you can find more details about Stef and his work.\r\n\r\nMaterials\r\nThe slides that accompanied Stef’s presentation.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-19-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Asier Moneva",
        "url": "https://nscr.nl/en/medewerker/asier-moneva/"
      }
    ],
    "date": "2022-04-19",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThe dataset for this Tidy Tuesday is about indoor air pollution! Asier Moneva explores the following research question: “How have trends in deaths due to household air pollution from solid fuels evolved in the EU countries over the last 30 years?” Feel free to explore this question yourselves and share your experience with us.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nAsier Moneva is a postdoc at the NSCR and The Hague University of Applied Sciences with a background in criminology. He started specializing in crime analysis with R during his master’s degree and has since developed an interest in open science.\r\n\r\nMaterials\r\nThe R script that Asier worked through is in this GitHub repository that Asier worked through.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-14-discrete-spatial-choice-in-r/",
    "title": "Discrete Spatial Choice in R",
    "description": "Learn how to set up data and estimate discrete spatial choice models in R",
    "author": [
      {
        "name": "Wim Bernasco",
        "url": "https://nscr.nl/en/medewerker/prof-dr-wim-bernasco/"
      }
    ],
    "date": "2022-04-14",
    "categories": [],
    "contents": "\r\nDiscrete choice is choosing a single item or action from a finite set of alternatives. We do it all the time, when we shop for new clothes, select a dish from the menu, choose to commute by bus, train or bike, select a job or an applicant, or when we swipe potential partners on Tinder.\r\nDiscrete spatial choice is when the alternatives are spatial entities, e.g. when we choose where to buy a house, where to go on holiday, or where to commit a crime. With data on what has been chosen and on what could have been chosen, discrete choice models can help us understand the decision process and predict its outcome: how do features of the alternatives (e.g. monetary cost of profits, distance, comfort, taste, looks) affect which alternative is chosen?\r\nIn this workshop, Wim Bernasco explained the key elements of discrete choice models, just enough for you to get going and still know what you are doing. Subsequently he showed what the necessary data look like, how they can be organized, and how discrete choice models can be estimated in R.\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\nWim Bernasco is senior researcher at NSCR and professor at the School of Business and Economics at the Vrije Universiteit Amsterdam. His work focuses on the geography of crime, incuding crime location choice and offender mobility. Read more on his personal website.\r\n\r\nMaterials\r\nTo install the packages used in this workshop, type and run: install_packages(c(\"tidyverse\", \"broom\", \"survival\", \"mlogit\", \"car\"))\r\nWim covered a subset of the material presented in a recent handbook chapter. In the workshop, he worked with a shortened tidyverse style version of the script that is described in the handbook chapter.\r\nData files, data documentation and the R script are available in this GitHub repository.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-05-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/en/medewerker/sam-langton/"
      }
    ],
    "date": "2022-04-05",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nIn this session, Sam Langton demonstrated long to wide (and wide to long) transformations using functions available in the tidyr package using data from the London Fire Brigade.\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nYou can find the material for this workshop in this GitHub repository.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-03-31-shiny-2of2/",
    "title": "Creating web applications with Shiny (2/2)",
    "description": "Learn how to make interactive tables, graphs and text from data.",
    "author": [
      {
        "name": "Nick van Doormaal",
        "url": "https://www.linkedin.com/in/nick-van-doormaal-9213a7a2/"
      }
    ],
    "date": "2022-03-31",
    "categories": [],
    "contents": "\r\nIn a two-sessions workshop, Nick van Doormaal will demonstrate how to use the shiny package to create interactive web applications. Note that this is the second session of a two-sesssion workshop. The first session (on Thursday March 17) was be a basic introduction on the different components of a shiny app. In this second session we explore into more depth how ‘reactivity’ works, an important component of most shiny apps.\r\nTo prepare for the workshop, you may want to take a look this key resource for shiny, in particular Chapter 3.\r\nIn advance of the workshop, we suggest you install these two R packages (just copy and paste this line into your R Studio Editor and run it)\r\ninstall.packages(c(“tidyverse”, “shiny”))\r\n\r\nNick van Doormaal is a former PhD candidate at the NSCR and currently a data analyst at the environmental service of the province of Gelderland. He got into R during his MSc thesis and internship and has been using R ever since.\r\n\r\nJoin this workshop meeting on Zoom by clicking this link\r\nMaterials\r\nOn Nick’s GitHub repository nscr-shiny-workshop you can find the data and the R script that documents the development that Nick demonstrated during the workshop.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-03-22-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Wim Bernasco",
        "url": "https://nscr.nl/en/medewerker/prof-dr-wim-bernasco/"
      }
    ],
    "date": "2022-03-22",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nSports in general and football (soccer) in particular provides a sheer endless source of open data that can be explored at various levels (player, team, match, competition) and from various perspectives. In this meeting Wim Bernasco used open data about football borrowed from a GitHub repository maintained by James Curley (James P. Curley (2016). engsoccerdata: English Soccer Data 1871-2016. R package version 0.1.5 DOI: 10.5281/zenodo.13158).\r\nThe engsoccerdata repository contains data on football matches from the UK Premier League and other European football leagues. In this Tidy Tuesday used data from almost a complete century (1929-2020) of matches in the Spanish League called La Liga.\r\nWe tried to answer a couple of simple questions:\r\nIs it true that there are less goals today than in earlier days?\r\nIs the number of goals related to the season of the year?\r\nIs playing home really an advantage?\r\nIf so, has this advantage changed over time?\r\n\r\nWim Bernasco is a senior researcher at the Netherlands Institute for the Study of Crime and Law Enforcement (NSCR) and a professor in Spatial analysis of crime at the School of Business and Economics at the Vrije Universiteit Amsterdam. Most of his work in criminology is about the geography of crime, offender decision making and situational causes of crime.\r\n\r\nMaterials\r\nThe script that documents the analysis that Wim demonstrated during the workshop is available in this GitHub repository. It includes installation of packages, loading libraries, reading data and substantive analysis.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-03-17-shiny-1of2/",
    "title": "Creating web applications with Shiny (1/2)",
    "description": "Learn how to make interactive tables, graphs and text from data.",
    "author": [
      {
        "name": "Nick van Doormaal",
        "url": "https://www.linkedin.com/in/nick-van-doormaal-9213a7a2/"
      }
    ],
    "date": "2022-03-17",
    "categories": [],
    "contents": "\r\nIn a two-sessions workshop, Nick van Doormaal demonstrated how to use the shiny package to create interactive web applications. Note that this was the first session of a two-sesssion workshop. This first session was be a basic introduction on the different components of a shiny app. In the second session (on Thursday March 31) we explored into more depth how ‘reactivity’ works, an important component of most shiny apps.\r\nFor inspiration, you may want to spend a few minutes viewing some fun apps made with shiny, or this shiny gallery.\r\nTo prepare for the workshop, you could install these two R packages (just copy and paste this line into your R Studio Editor and run it)\r\ninstall.packages(c(“tidyverse”, “shiny”))\r\n\r\nNick van Doormaal is a former PhD candidate at the NSCR and currently a data analyst at the environmental service of the province of Gelderland. He got into R during his MSc thesis and internship and has been using R ever since.\r\n\r\nMaterials\r\nOn Nick’s GitHub repository nscr-shiny-workshop you can find the data and the R script that documents the development that Nick demonstrated during the second workshop on Thursday March 31.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-03-08-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Tim Verlaan",
        "url": "https://nscr.nl/en/medewerker/tim-verlaan"
      }
    ],
    "date": "2022-03-08",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nJoin this workshop meeting on Zoom by clicking this link\r\nIn this meeting, Tim will explain what Sankey diagrams are, and how they can be created in R.\r\n\r\nTim Verlaan is a PhD candidate at the Netherlands Institute for the Study of Crime and Law Enforcement (NSCR).\r\n\r\nMaterials\r\nThe script (R) that Tim worked through.\r\nThe presentation that Tim used.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-03-03-tidymodels/",
    "title": "Tidymodels",
    "description": "Introduction to the `tidymodels` package for modeling and machine learning.",
    "author": [
      {
        "name": "Natan Khadaroo-McCheyne",
        "url": "https://twitter.com/nathankhadaroo"
      }
    ],
    "date": "2022-03-03",
    "categories": [],
    "contents": "\r\n\r\n\r\nThis session will provide a hands-on overview of basic concepts in machine learning, and show how they can be easily implemented in R using the new Tidymodels framework. The Tidymodels framework is a collection of packages for modeling and machine learning using tidyverse principles. We will cover how to build fully reproducible machine learning workflows that are easy to interpret and implement, including key steps such as pre-processing, model fitting and tuning, and model performance evaluation and visualisation.\r\n\r\n\r\n\r\n\r\n\r\n\r\nJoin this workshop meeting on Zoom by clicking this link\r\n\r\n\r\nNathan is a PhD candidate at the Institute for Data Science and Artificial Intelligence at the University of Manchester. He is writing his thesis on new methods for crowdsourcing spatio-temporal data. Nathan completed his BA in political science at the University of Manchester. His current research interests include citizen science, exploring statistical methodology for new and unconventional forms of data, contemporary debates in philosophy of statistics, open-sourced software (in particular R and Julia languages), communicating uncertainty, and cooking.\r\n\r\n\r\nMaterials\r\nMaterials will be made available by Nathan after the workshop! We will post links to the material here.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-22-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://www.alexandertrinidad.com/"
      }
    ],
    "date": "2022-02-22",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nJoin this workshop meeting on Zoom by clicking this link\r\nThe dataset for this Tidy Tuesday is about animal rescues! Alex Trinidad explores the temporal trends of animal rescues using lubridate package (Grolemund & Wickham, 2011).\r\nMaterials\r\nThe script (R) that Alex worked through.\r\nThe CRAN documentation.\r\nAbout lubridate.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-17-looping-in-r/",
    "title": "Looping in R",
    "description": "Learn how to use loops in R.",
    "author": [
      {
        "name": "Wouter Steenbeek",
        "url": "https://nscr.nl/en/medewerker/wouter-steenbeek/"
      }
    ],
    "date": "2022-02-17",
    "categories": [],
    "contents": "\r\nA loop is a sequence of one or more R commands that is carried out repeatedly. In this workshop meeting you will learn how to efficiently program loops in R\r\nJoin this workshop meeting on Zoom by clicking this link\r\nBy way of preparation, you might want to install two packages:\r\ninstall.packages(“tidyverse”)\r\ninstall.packages(“foreach”)\r\n\r\nWouter Steenbeek is a senior researcher at the Netherlands Institute for the Study of Crime and Law Enforcement (NSCR). He started using R around 2012. His main research interests are in spatial patterns of crime and quantitative research methods.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-08-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Asier Moneva",
        "url": "https://nscr.nl/en/medewerker/asier-moneva/"
      }
    ],
    "date": "2022-02-08",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nThe dataset for this Tidy Tuesday is about board games! Asier Moneva explores the following research questions: “What are the top 3 best-selling board games by game type?” and “How do board game sales relate to online user ratings?” Feel free to explore these questions yourselves and share your experience with us.\r\nMaterials\r\nThe R script that Asier worked through is in this Github repository.\r\nThe Tidy Data paper (pre-print) by Hardley Wickham (2014) is here.\r\nHow to download files from GitHub\r\nTo download files from GitHub you can:\r\nClone the repository to create a local copy in your computer. To clone a repository, follow the instructions here.\r\nAlternatively, you can:\r\nDownload all files compressed in a ZIP. To do this, go to the repository and click on the green code button, then select download ZIP. Unzip the downloaded file into a folder on your local computer.\r\nDownload a specific file. To do this, select the desired file in the repository and click on the raw button. Then right click on the new page and select save as. Don’t forget to put the proper extension in the save name, like .R or .Rmd.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-03-text-analysis-in-r/",
    "title": "Text analysis in R",
    "description": "How to process free-text data in R",
    "author": [
      {
        "name": "Anthony Dixon",
        "url": "https://www.researchgate.net/profile/Anthony-Dixon-10/"
      }
    ],
    "date": "2022-02-03",
    "categories": [],
    "contents": "\r\nMuch information is stored as free-text. Free-text is weakly structured and therefore hard to extract and organize. This workshop will explore some elements of working with free-text data in R, principally how it can be prepared and transformed to be used with machine learning algorithms.\r\nJoin this workshop meeting on Zoom by clicking this link\r\nAnthony Dixon is a postgraduate researcher at the University of Leeds, working in the School of Law and the Leeds Institute of Data Analytics. The topic of his thesis is ‘Improving Problem-oriented policing with Natural Language Processing’, which seeks to explore the use of state-of-the-art deep learning models to automatically extract information from police free-text data. Additionally he has joint published a number of papers covering crime changes as a result of the covid-19 pandemic.\r\nMaterials\r\nYou can download the materials used in the workshop here.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-25-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions moderated by your own colleagues.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/en/medewerker/sam-langton/"
      }
    ],
    "date": "2022-01-25",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which was aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nAs a continuation of his workshop on January 11, Sam Langton demonstrated some foundational R skills using a Tidy Tuesday dataset on the nutritional (or not so nutritional) content of Starbucks drinks.\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nYou can find the material for this workshop here.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-20-network-analysis-in-r/",
    "title": "Network analysis in R",
    "description": "An introduction to network data, network visualization and network analysis.",
    "author": [
      {
        "name": "Ieke de Vries",
        "url": "https://www.iekedevries.com/"
      }
    ],
    "date": "2022-01-20",
    "categories": [],
    "contents": "\r\nNetwork analysis is a topic of growing interest in criminology and beyond. This workshop gives a short introduction and overview of network analysis in R, beginning with a conceptual discussion of what networks are. In their simplest form, networks are comprised of actors (“nodes”) and relationships between them (“edges”). Network analysis concerns the analytical approach to study these edges between nodes of any kind (e.g., individuals, businesses, experiences, words, or streets). The workshop proceeds with an introduction to network analysis in R, focusing on i) creating and reading network data; ii) describing and visualizing networks; and iii) explaining the formation of networks.\r\nJoin this workshop meeting on Thursday January 20, 2022 at 13:00 on Zoom by clicking this link\r\nTo prepare for the workshop, you may want to install a few R packages (just copy and paste these lines into your R Studio Editor and run them):\r\ninstall.packages(“tidyverse”)\r\ninstall.packages(“igraph”)\r\ninstall.packages(“tidygraph”)\r\ninstall.packages(“ggraph”)\r\ninstall.packages(“statnet”)\r\n\r\nIeke de Vries is an Assistant Professor at the Institute of Criminal Law and Criminology at Leiden University. In her current work, she applies a network approach to examine co-arrest and spatial networks in Chicago, social and spatial networks in the context of human trafficking, and networks of victimizing experiences and behaviors. Besides conducting her research mostly in R, she has also taught an ‘Introduction to Computational Statistics in R’ to graduate students and ‘Programming with Data in Python’ to undergraduate students at Northeastern University and a Summer Course on ‘Crime, Data, and Ethics’ to honours students at Leiden University.\r\n\r\nMaterials\r\nMaterials for the workshop are available at Github.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:12+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-11-nsc-r-tidy-tuesday/",
    "title": "NSC-R Tidy Tuesday",
    "description": "Improve your R skills in entertaining, inspiring and supportive sessions presented by your colleagues.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/en/medewerker/sam-langton/"
      }
    ],
    "date": "2022-01-11",
    "categories": [],
    "contents": "\r\nThe NSC-R Tidy Tuesday workshop sessions are inspired by the Tidy Tuesday initiative, which is aimed at providing a safe and supportive forum for individuals to practice their data processing and visualization skills in R while working with real-world data.\r\nSam Langton demonstrated some foundational R skills using a Tidy Tuesday dataset on the nutritional (or not so nutritional) content of Starbucks drinks.\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nYou can find the material for this workshop here.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-07-distill/",
    "title": "Using R package distill to build websites",
    "description": "How to use the R package distill to build websites (like this one)",
    "author": [
      {
        "name": "Harrie Jonkman",
        "url": "www.harriejonkman.nl/"
      }
    ],
    "date": "2021-12-07",
    "categories": [],
    "contents": "\r\nDistill is a package built on and for RMarkdown, the ecosystem of packages for creating computational documents in R.\r\nThe goal of the distill package is to provide an output format optimized for online scientific and technical communication. The distill-R package provides HTML output formats for R Markdown documents. With the use of distill you can make articles, blogs and websites.\r\nThe goal of the developers of distill was to create a platform to help scientists harness the benefits of modern HTML-based communication, which digital designers and journalists have been using to create interactive and engaging articles that meet readers where they are: online.\r\nIn this workshop you are introduced to this package. You learn how to build your own website and blog, how to place it on GitHub and deploy it for free by using Netlify. Harrie Jonkman and the NSC-R team members developed a website for the NSC-R workshops by using distill (you are reading it right now).\r\nMore information\r\nA very accessible description of how to use distill to build websitres is Building a distill website by by Liza Lendway.\r\nAnother description of how to build websites with distill is Building a blog with distill, targeted.\r\ndistill was created by people at R Studio. This is RStudio’s official website link on distill\r\nYou could also check out RStudio’s new developments on distill\r\n\r\nHarrie Jonkmanis a senior researcher at the Verwey Jonker Institute. He works in the field of cognitive and social development of children and youngsters in relation to the contexts in which they grow up (family, school, friends, community and country). Recently he edited with David Farrington and Frederick Groeger-Roth Delinquency and Substance Use in Europe. Understanding Risk and Protective Factors. He also finished recently the open-source book Terugschrijven on knowledge, development and democracy. He is interested in open-source data analysis and has his blog Harrie’s Hoekje on this topic.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-25-github/",
    "title": "Using GitHub for version control, collaboration and code sharing.",
    "description": "A workshop on using GitHub for version control, collaboration and code sharing.",
    "author": [
      {
        "name": "Harrie Jonkman",
        "url": "www.harriejonkman.nl/"
      }
    ],
    "date": "2021-11-25",
    "categories": [],
    "contents": "\r\nVersion control is essential for keeping track of data analysis projects. It is also essential for collaboration with other researchers and developers.\r\nGit, GitHub in combination with R/RStudio allow you to back up texts and scripts and to collaborate on complex projects. Git and GitHub are open source version control systems which work quiet well together with R/RStudio.\r\nThis workshop introduced this system, demonstrated how to create a repository on GitHub, and how to do this from R/RStudio (see Harrie’s presentation (PDF)).\r\nThe workshop also included a live demonstration of how collaboration between multiple people works in a simple repository/project.\r\nThe workshop was connected to the subsequent workshop in which the new NSC-R Workshop website was be presented (the one you are reading now). This website is developed by the NSC-R team members who worked together on this in Git, GitHub and R/RStudio.\r\nMore information\r\nBelow are links to potentially usefull sources about Git, Github and their integration with R/RStudio.\r\nDouglas, A., Roos, D., Mancini, F., Couto, A. and Lusseau, D., An introduction to R, chapter 9, here.\r\nBryan, J., Happy Git and GitHub for the useR, here\r\nLendway, L., github_for_collaboration, here\r\nLisa Lendway on YouTube\r\nUsing Git and GitHub in R Studio\r\nUsing Git and GitHub in R\r\n\r\nHarrie Jonkmanis a senior researcher at the Verwey Jonker Institute. He works in the field of cognitive and social development of children and youngsters in relation to the contexts in which they grow up (family, school, friends, community and country). Recently he edited with David Farrington and Frederick Groeger-Roth Delinquency and Substance Use in Europe. Understanding Risk and Protective Factors. He also finished recently the open-source book Terugschrijven on knowledge, development and democracy. He is interested in open-source data analysis and has his blog Harrie’s Hoekje on this topic.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-12-small_area_estimation/",
    "title": "Small area estimation for crime analysis",
    "description": "Small area estimation for crime analysis.",
    "author": [
      {
        "name": "David Buil-Gil",
        "url": "http://lesscrime.info/"
      }
    ],
    "date": "2021-11-09",
    "categories": [],
    "contents": "\r\nAccording to David Buil-Gil, victimization surveys provide key information about crimes known and unknown to the police, and are the main source of data to analyse perceived safety and confidence in policing. These surveys, however, are only designed to allow aggregating responses and producing reliable direct estimates (i.e., weighted means or totals) at very large spatial scales, such as countries or states. Sample sizes are too small to produce direct estimates of adequate precision at the increasingly refined spatial scales of the criminology of place. Model-based small area estimation techniques may be used to improve the reliability of small area estimates produced from victimization surveys. Small area estimation techniques are applied to produce reliable estimates of parameters of interest (and their associated measures of error) for areas for which only small or zero sample sizes are available. This workshop will introduce theory and show a step-by-step exemplar study in R to illustrate the utility of small area estimation for crime and place research. You find materials here. And his presentation here\r\n\r\nDavid Buil-Gil is a Lecturer in Quantitative Criminology at the Department of Criminology of the University of Manchester, and a core member of the Manchester Centre for Digital Trust and Society. His research areas cover geographic criminology, small area estimation applications in criminology, measurement error in criminological research, new methods for data collection, and open data.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-12-forecasting/",
    "title": "COVID-19 crime forecasting models",
    "description": "COVID-19 crime forecasting models.",
    "author": [
      {
        "name": "Matt Ashby",
        "url": "http://lesscrime.info/"
      }
    ],
    "date": "2021-10-28",
    "categories": [],
    "contents": "\r\n\r\nMatt Ashby is a lecturer in crime science at the Jill Dando Institute of Security and Crime Science at University College London (UCL). He is interested in crime analysis – particularly how crime concentrates in time and space – in crime prevention and in transport crime. You can find read more about Matt on his website.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-27-crimeforecastingmodels/",
    "title": "Crime forecasting models",
    "description": "Using R to analyze time series data and forecast crime.",
    "author": [
      {
        "name": "Matt Ashby",
        "url": "https://www.ucl.ac.uk/jill-dando-institute/people/dr-matt-ashby"
      }
    ],
    "date": "2021-10-28",
    "categories": [],
    "contents": "\r\nMatt Ashby talks about how to use time-series data in R for tasks such as understanding temporal patterns in crime data and forecasting the future frequency of crime under different scenarios, either for future planning or as a counter-factual against which to compare actual against forecast crime frequency.\r\nHere are links to\r\nMatt’s slides for the presentation\r\nThe code creating the slides for the presentation\r\nThe code for the example that Matt worked through during the presentation.\r\n\r\nMatt Ashby is a lecturer in crime science at the Jill Dando Institute of Security and Crime Science at University College London (UCL). He uses R to analyse spatial and temporal patterns of crime and police data as well as teaching crime mapping and crime analysis in R. He is also the author of the ‘crimedata’ package for conveniently accessing large datasets of recorded crime for research.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-27-tidyverse/",
    "title": "Introduction to the tidyverse",
    "description": "Introduction to the tidyverse collection of packages.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/medewerker/sam-langton/"
      }
    ],
    "date": "2021-10-12",
    "categories": [],
    "contents": "\r\nThis workshop covered the basics of the tidyverse – a collection of packages in R which can be used to import, tidy, transform and visualise data. The material is suitable for people with very little experience in R, but also seasoned R users who have not yet delved into the tidyverse. The skills covered were foundational and generic to almost any research project. The workshop centred around a demonstration which tackles a realistic, ‘messy’ dataset about animal rescue incidents dealt with by the London Fire Brigade.\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nYou can find the material for this workshop on GitHub or alternatively on Dropbox.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-27-spatialregression/",
    "title": "Spatial Regression",
    "description": "Regression analysis and spatial regression analysis in R.",
    "author": [
      {
        "name": "Wouter Steenbeek",
        "url": "https://nscr.nl/en/medewerker/wouter-steenbeek/#onderzoeksgebieden"
      },
      {
        "name": "Stijn Ruiter",
        "url": "https://nscr.nl/en/medewerker/stijn-ruiter/#onderzoeksgebieden"
      }
    ],
    "date": "2021-09-27",
    "categories": [],
    "contents": "\r\nThis workshop session was about using R for regression analysis, both in a non-spatial and a spatial context. Wouter and Stijn presented parts of what they prepared for a recent book chapter (in press). Here you can find the data, the syntax and the html-file presented in the workshop meeting.\r\n\r\nWouter is a Senior Researcher at the NSCR. For analyses he has used Excel, SPSS, Stata Mplus, MLWiN, and QGis. Not a big fan of C++ and Java, but once upon a time he knew the basics. Wouter started using R around 2012, due to a collaboration with a visiting scholar who used R. Classic case of SIR model (Susceptible - Infection - Recovery) although he has never recovered from his R infection. Also, the R bug destroyed his interest in the above-mentioned programs :-). His main research interests are in spatial patterns of crime and quantitative research methods.\r\n\r\n\r\nStijn is a Senior Researcher and management team member at the NSCR. He is program leader of two of its five research groups, and also Professor at the Department of Sociology, Utrecht University. Stijn has used R ever since he attended the Summer School in Ann Arbor in 2004, even for generating his kitchen tiling pattern. His main research interests are in Geographic and Environmental Criminology, Policing, Quantitative, Analytical, and Computational Sociology, and he is a great believer in Open Science and Open-source.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-14-opendata/",
    "title": "OpenData",
    "description": "Introduction to open data and how they can be found, downloaded and processed in R.",
    "author": [
      {
        "name": "Sam Langton",
        "url": "https://nscr.nl/medewerker/sam-langton/"
      }
    ],
    "date": "2021-09-14",
    "categories": [],
    "contents": "\r\nThis workshop session provided an introduction to open data using R. Following a brief introductory presentation (e.g. definitions, purpose) the bulk of the workshop focused on practical examples which demonstrated how to obtain and handle open data within the R environment.\r\n\r\nSam Langton is a postdoc researcher on the evidence-based policing programme at the NSCR. His research focuses on describing and explaining the spatial and temporal patterning of police demand. Sam is interested in promoting open science in criminology, particularly through open data and sharing his knowledge (and struggles) in R.\r\n\r\nMaterials\r\nYou can find the material for this workshop here.\r\nYou might find this corresponding book chapter (in press) interesting too.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-02-spatialdata/",
    "title": "Spatial Data",
    "description": "How to work with spatial data.",
    "author": [
      {
        "name": "Alex Trinidad",
        "url": "https://nscr.nl/medewerker/dr-alex-trinidad/"
      }
    ],
    "date": "2021-09-02",
    "categories": [],
    "contents": "\r\nThe third meeting of the NSC-R Workshop was on Thursday September 2, 13:00-14:00 hr. Alex Trinidad introduced us to spatial data and how they can be processed in R.\r\nLearning to work with spatial data allows us to broaden our toolbox and our research horizons. In this workshop, we worked on the basic concepts of spatial data usage, data preparation, and basic visualisations. The aim was to introduce you to how to work with spatial data in R and provide materials that helped to go deeper into this type of data.\r\nTo prepare for the meeting, Alex suggested you might want to take a look at the following links. This is obviously not mandatory, but the materials may give rise to ideas or questions that you may want to discuss in the workshop meeting:\r\nLovelance, R., Nowosad, J., & Muenchow, J. Geocomputation with R. CRC Press.\r\nBivand, R. S., Pebesba, E., & Gómez-Rubio, V. Applied Spatial Data Analysis with R. Springer.(Access from university library)\r\nAlex’ scripts and data you can find here.\r\n\r\nAlex is a postdoctoral researcher/ lecturer at the Institute of Sociology and Social Psychology (ISS) at the University of Cologne, Germany. He is also a research fellow at the Netherlands Institute for the Study of Crime and Law Enforcement (NSCR). His interest in spatial analysis began when he started his PhD, exploring the spatial distribution of juvenile delinquency and the contextual factors associated with it. It was also during his PhD that he began his journey with R.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-06-rmarkdown/",
    "title": "RMarkdown",
    "description": "Introduction to literate programming using RMarkdown",
    "author": [
      {
        "name": "Asier Moneva",
        "url": "https://nscr.nl/en/medewerker/asier-moneva/"
      }
    ],
    "date": "2021-07-06",
    "categories": [],
    "contents": "\r\nMarkdown is a language for producing formatted text with a simple text editor conceived with the idea of being human-readable from source. If you remember Thomas de Graaff’s talk from two weeks ago, having human readable code is important for a number of reasons, such as being easy to debug, maintain, and extend.\r\nRMarkdown is simply a software that allows the implementation of this language in R. This makes it possible to produce open-access, fully reproducible documents.\r\nHere you can find Asier’s presentation, scripts and additional materials.\r\nTo show you the basics, Asier followed the book R Markdown: The Definitive Guide by Xie, Allaire and Grolemund. He recommends you read the Preface before the workshop. However, as a definitive guide, you can deduce that this book does not only cover the basics, so you can also use it to go deeper.\r\nOnce you have mastered tha basics of RMarkdown, you might want to take a look at the RMarkdown Cookbook\r\nTo have all the main commands at hand, you can print this double-sided RMarkdown cheat sheet. (We love cheat sheets.)\r\nAnd for a quick overview of RMarkdown, just watch this video.\r\nHere you can find an Elsevier template for RMarkdown\r\n\r\nAsier is a postdoc at the NSCR and The Hague University of Applied Sciences with a background in criminology. He started specializing in crime analysis with R during his master’s degree and has since developed an interest in open science.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-24-workshop1-reproducibility/",
    "title": "Reproducibility",
    "description": "How to organize your research workflow in R to create documented code and reproducible findings.",
    "author": [
      {
        "name": "Thomas de Graaff",
        "url": "https://research.vu.nl/en/persons/thomas-de-graaff"
      }
    ],
    "date": "2021-06-24",
    "categories": [],
    "contents": "\r\nOn Thursday June 24, 13:00-14:00, we kicked off the NSC-R Workshop initiative. The topic of this first meeting was reproducibility, which is about how to organize your research workflow to create documented code and reproducible findings. The focus was not on why (we should know), but on practical guidelines on how to do it. It was presented by Thomas de Graaff.\r\nHere you find the presentation\r\nTo prepare for the first meeting, Thomas de Graaff suggested you might want to take a look at the following links. This is obviously not mandatory, but the materials may give rise to ideas or questions that you may want to discuss in the workshop meeting:\r\nA very readable post on reproducible workflow in R.\r\nA nice short blog post about R projects.\r\nIf you are using R already and in particular if you use tidyverse, a long book-down document about coding style conventions.\r\nA wonderful but distressing lecture (and long: about 50 minutes) from Richard McElreath about working with software in the social sciences, with a criminology paper example in the end on racial disparity in police use of deadly force. Click this YouTube link.\r\nYou may also want to consult this textbook:\r\nGandrud, C. Reproducible Research with R and RStudio, Second edition. Click to download the PDF\r\n\r\nThomas de Graaf is associate professor at the department of Spatial Economics at the Vrije Universiteit in Amsterdam.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-27T18:06:11+02:00",
    "input_file": {}
  }
]
